# ==============================================================================
# General Utilities & CLI Tools
# Essential command-line utilities for text processing, navigation, and editing
# ==============================================================================
brew "asdf"
brew "bat"
brew "direnv"
brew "docutils"
brew "gawk"
brew "git"
brew "graphviz"
brew "jq"
brew "neovim"
brew "node"
brew "pyenv"
brew "python"
brew "ripgrep"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "yq"

# ==============================================================================
# Version Control & Collaboration
# Tools for interacting with Git providers and managing repositories
# ==============================================================================
brew "gh"
brew "glab"

# ==============================================================================
# Cloud Providers & Cloud Utilities
# CLI tools and helpers for AWS and other cloud services
# ==============================================================================
brew "aws-iam-authenticator"
brew "awscli"
brew "cfn-lint"
brew "git-remote-codecommit"

# ==============================================================================
# Infrastructure as Code (IaC) & Automation
# Tools for provisioning, configuring, and managing infrastructure
# ==============================================================================
brew "ansible"
brew "ansible-lint"
brew "infracost"
brew "tenv"
brew "terraform-docs"
brew "terragrunt-atlantis-config"

# ==============================================================================
# Kubernetes & Containers
# Tools for managing Kubernetes clusters and working with containers
# ==============================================================================
brew "argocd"
brew "container" if OS.mac?
brew "helm"
brew "k9s"
brew "kubectx"
brew "k6"

# ==============================================================================
# Security, Compliance, & Linting
# Security scanners, linters, and policy engines for code and infrastructure
# ==============================================================================
brew "checkov"
brew "cosign"
brew "jsonlint"
brew "kube-linter"
brew "opa"
brew "pre-commit"
brew "sops"
brew "terrascan"
# brew "tflint" # Removed because of license
brew "tfsec"
brew "tfupdate"
brew "trivy"
brew "yamllint"

# ==============================================================================
# Networking & Cryptography
# Networking utilities and cryptographic libraries
# ==============================================================================
brew "gnupg"
brew "gnutls"
brew "nghttp2"
brew "nmap"
brew "pkcs11-helper"
brew "telnet"
brew "unbound"
# brew "openvpn"

# ==============================================================================
# Casks
# macOS native applications and fonts
# ==============================================================================
cask "font-meslo-lg-nerd-font" if OS.mac?
cask "font-fira-code-nerd-font" if OS.mac?
cask "joplin" if OS.mac?

# ==============================================================================
# Krew Plugins
# Kubernetes CLI plugins managed by Krew
# ==============================================================================
krew "krew"
krew "oidc-login"

# ==============================================================================
# Taps
# Additional third-party package repositories
# ==============================================================================
# tap "atlassian/acli"
# brew "atlassian/acli/acli"

# tap "agent-ecosystem/tap"
# brew "skill-validator"
